## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_cdn_frontdoor_endpoint.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "static-web-app" {
      + cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts"
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "afd-ep-swa-test"
    }

  # azurerm_cdn_frontdoor_origin.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_origin" "static-web-app" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = "gray-water-0dd3e8403.4.azurestaticapps.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "afd-o-swa-test"
      + origin_host_header             = "gray-water-0dd3e8403.4.azurestaticapps.net"
      + priority                       = 1
      + weight                         = 1
    }

  # azurerm_cdn_frontdoor_origin_group.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "static-web-app" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts"
      + id                                                        = (known after apply)
      + name                                                      = "afd-og-swa-test"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_route.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_route" "static-web-app" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "afd-rt-swa-test"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # azurerm_static_web_app_custom_domain.matthewjwhite-dev will be destroyed
  # (because azurerm_static_web_app_custom_domain.matthewjwhite-dev is not in configuration)
  - resource "azurerm_static_web_app_custom_domain" "matthewjwhite-dev" {
      - domain_name       = "tfttest.matthewjwhite.co.uk" -> null
      - id                = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Web/staticSites/matthewjwhite-dev2/customDomains/tfttest.matthewjwhite.co.uk" -> null
      - static_web_app_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Web/staticSites/matthewjwhite-dev2" -> null
      - validation_type   = "dns-txt-token" -> null
        # (1 unchanged attribute hidden)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_account.mta-sts will be updated in-place
  ~ resource "azurerm_storage_account" "mta-sts" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftestmtasts"
        name                               = "stmwtftestmtasts"
        tags                               = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.tftest-records.azurerm_dns_txt_record.txt["@"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "txt" {
        id                  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk/TXT/@"
        name                = "@"
        tags                = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (4 unchanged attributes hidden)

      # Warning: this block will no longer be marked as sensitive
      # after applying this change.
      ~ record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      # Warning: this block will no longer be marked as sensitive
      # after applying this change.
      ~ record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_account.mta-sts will be updated in-place
  ~ resource "azurerm_storage_account" "mta-sts" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftest2mtasts"
        name                               = "stmwtftest2mtasts"
        tags                               = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.
```
</details>